## HAM Project

In [220]:
#Run this cell without changes
import pandas as pd
import sqlite3
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [221]:
conn = sqlite3.connect('./zippedData/im.db')

In [222]:
imdb_schema = pd.read_sql("""

SELECT * from sqlite_master

""",conn)

imdb_schema

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [223]:
def read_sql_as_df(table_name, con):
   
    query = """SELECT * FROM ({table_name})""".format(table_name = table_name)
    return pd.read_sql(query,con)

In [224]:
tmdb_movies_df = pd.read_csv('./zippedData/tmdb.movies.csv.gz')
tmdb_movies_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [253]:
movie_budget = pd.read_csv('./zippedData/tn.movie_budgets.csv.gz')
movie_budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [255]:
movie_budget['release_date'] = pd.to_datetime(movie_budget['release_date'])
movie_budget['Year'] = movie_budget['release_date'].dt.year
movie_budget

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Year
0,1,2009-12-18,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011
2,3,2019-06-07,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019
3,4,2015-05-01,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017
...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,"$7,000",$0,$0,2018
5778,79,1999-04-02,Following,"$6,000","$48,482","$240,495",1999
5779,80,2005-07-13,Return to the Land of Wonders,"$5,000","$1,338","$1,338",2005
5780,81,2015-09-29,A Plague So Pleasant,"$1,400",$0,$0,2015
5781,82,2005-08-05,My Date With Drew,"$1,100","$181,041","$181,041",2005

In [227]:
decades_df = movie_budget[(movie_budget['Year'] >= 1980) & (movie_budget['Year'] <=2000)]

In [249]:
decades_df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Year
42,43,1997-12-19,Titanic,200000000.0,659363944.0,2.208208e+09,1997
106,7,1999-06-30,Wild Wild West,175000000.0,113805681.0,2.212293e+08,1999
109,10,1995-07-28,Waterworld,175000000.0,88246220.0,2.642462e+08,1995
199,100,1999-06-16,Tarzan,145000000.0,171091819.0,4.481918e+08,1999
207,8,1998-07-01,Armageddon,140000000.0,201578182.0,5.546000e+08,1998
...,...,...,...,...,...,...,...
5752,53,1991-08-01,Slacker,23000.0,1227508.0,1.227508e+06,1991
5762,63,1997-04-11,Pink Flamingos,12000.0,413802.0,4.138020e+05,1997
5769,70,1996-04-01,Bang,10000.0,527.0,5.270000e+02,1996
5773,74,1993-02-26,El Mariachi,7000.0,2040920.0,2.041928e+06,1993
5778,79,1999-04-02,Following,6000.0,48482.0,2.404950e+05,1999

In [229]:
TB_financials_df = decades_df

In [230]:
TB_financials_df['production_budget'] = TB_financials_df['production_budget'].str.replace('$','')
TB_financials_df['production_budget'] = TB_financials_df['production_budget'].str.replace(',','')
TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].str.replace('$','')
TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].str.replace(',','')
TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].str.replace('$','')
TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].str.replace(',','')

<ipython-input-230-f0444b46b1f4>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['production_budget'] = TB_financials_df['production_budget'].str.replace('$','')
<ipython-input-230-f0444b46b1f4>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['production_budget'] = TB_financials_df['production_budget'].str.replace(',','')
<ipython-input-230-f0444b46b1f4>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].str.replace('$','')
<ipython-input-230-f0444b46b1f4>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].str.replace(',','')
<ipython-input-230-f0444b46b1f4>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].str.replace('$','')
<ipython-input-230-f0444b46b1f4>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].str.replace(',','')

In [231]:
TB_financials_df['production_budget'] = TB_financials_df['production_budget'].astype(float)
TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].astype(float)
TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].astype(float)

<ipython-input-231-6bd145771d65>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['production_budget'] = TB_financials_df['production_budget'].astype(float)
<ipython-input-231-6bd145771d65>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].astype(float)
<ipython-input-231-6bd145771d65>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].astype(float)

In [263]:
decades_ROI_df = TB_financials_df[['worldwide_gross', 'Year', 'movie']]
decades_ROI_df = decades_ROI_df.sort_values(by='worldwide_gross',ascending=False) 
decades_ROI_df.head(50)

      worldwide_gross  Year                                     movie
42       2.208208e+09  1997                                   Titanic
824      1.038813e+09  1993                             Jurassic Park
303      1.027045e+09  1999       Star Wars Ep. I: The Phantom Menace
608      9.862149e+08  1994                             The Lion King
626      8.174009e+08  1996                          Independence Day
3525     7.929653e+08  1982                 ET: The Extra-Terrestrial
981      6.798506e+08  1994                              Forrest Gump
1374     6.728063e+08  1999                           The Sixth Sense
630      6.186390e+08  1997             The Lost World: Jurassic Park
2485     6.084311e+08  1991                      Beauty and the Beast
438      5.877905e+08  1997                              Men in Black
1783     5.727051e+08  1983      Star Wars Ep. VI: Return of the Jedi
207      5.546000e+08  1998                                Armageddon
283      5.495885e+08  2000                     Mission: Impossible 2
2367     5.341613e+08  1980  Star Wars Ep. V: The Empire Strikes Back
2404     5.176000e+08  1990                                     Ghost
364      5.154198e+08  1991                Terminator 2: Judgment Day
439      5.113583e+08  1999                               Toy Story 2
2032     5.040502e+08  1992                                   Aladdin
481      4.957000e+08  1996                                   Twister
770      4.850351e+08  1998                       Saving Private Ryan
2991     4.766847e+08  1990                                Home Alone
1213     4.741718e+08  1989        Indiana Jones and the Last Crusade
775      4.635174e+08  1999                                The Matrix
539      4.576980e+08  1996                       Mission: Impossible
355      4.576838e+08  2000                                 Gladiator
199      4.481918e+08  1999                                    Tarzan
2160     4.412860e+08  1993                            Mrs. Doubtfire
3171     4.326459e+08  1990                              Pretty Woman
487      4.272305e+08  2000                                 Cast Away
2724     4.242000e+08  1990                        Dances with Wolves
543      4.163855e+08  1999                                 The Mummy
2161     4.128000e+08  1988                                  Rain Man
1626     4.113489e+08  1989                                    Batman
2167     4.108990e+08  1992                             The Bodyguard
1085     3.905000e+08  1991             Robin Hood: Prince of Thieves
2723     3.855248e+08  1985                        Back to the Future
273      3.760000e+08  1998                                  Godzilla
771      3.741051e+08  2000                           What Women Want
2405     3.698847e+08  1998              There's Something About Mary
2486     3.674521e+08  1981                   Raiders of the Lost Ark
453      3.661017e+08  1995                Die Hard: With a Vengeance
370      3.653000e+08  1994                                 True Lies
1836     3.645455e+08  1995                                 Toy Story
1344     3.637281e+08  1999                              Notting Hill
1252     3.630953e+08  1998                              A Bug's Life
227      3.617307e+08  1999                   The World is Not Enough
2488     3.589948e+08  1992            Home Alone 2: Lost in New York
1254     3.585000e+08  1994                           The Flintstones
2993     3.567996e+08  1986                                   Top Gun

In [288]:
duplicated_movies = movie_budget[movie_budget['movie'].duplicated(keep=False)==True]
duplicated_movies.sort_values(by='movie')

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Year
4270,71,1954-12-23,"20,000 Leagues Under the Sea","$5,000,000","$28,200,000","$28,200,000",1954
5614,15,1916-12-24,"20,000 Leagues Under the Sea","$200,000","$8,000,000","$8,000,000",1916
1648,49,2010-04-30,A Nightmare on Elm Street,"$35,000,000","$63,075,011","$117,729,621",2010
5016,17,1984-11-09,A Nightmare on Elm Street,"$1,800,000","$25,504,513","$25,504,513",1984
2032,33,1992-11-11,Aladdin,"$28,000,000","$217,350,219","$504,050,219",1992
...,...,...,...,...,...,...,...
3403,4,2017-04-21,Unforgettable,"$12,000,000","$11,368,012","$16,221,211",2017
1420,21,2011-02-18,Unknown,"$40,000,000","$63,686,397","$136,123,083",2011
4583,84,2006-11-03,Unknown,"$3,700,000","$26,403","$3,355,048",2006
2313,14,2005-09-16,Venom,"$25,000,000","$881,745","$881,745",2005
302,3,2018-10-05,Venom,"$116,000,000","$213,511,408","$853,628,605",2018

In [290]:
movie_budget['Reboot'] = movie_budget['movie'].duplicated(keep=False)==True
movie_budget

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Year,Reboot
0,1,2009-12-18,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009,False
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,False
2,3,2019-06-07,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,False
3,4,2015-05-01,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015,False
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017,False
...,...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,"$7,000",$0,$0,2018,False
5778,79,1999-04-02,Following,"$6,000","$48,482","$240,495",1999,False
5779,80,2005-07-13,Return to the Land of Wonders,"$5,000","$1,338","$1,338",2005,False
5780,81,2015-09-29,A Plague So Pleasant,"$1,400",$0,$0,2015,False
5781,82,2005-08-05,My Date With Drew,"$1,100","$181,041","$181,041",2005,False